import pandas as pd

stock_dict = [
    {
        '날짜':'2021-12-31',
        '종목':'삼성전자',
        '시가':'80,400',
        '종가':'90,234'
    },
     {
        '날짜':'2021-12-31',
        '종목':'LG전자',
        '시가':'34,400',
        '종가':'10,234'
    }, {
        '날짜':'2021-12-31',
        '종목':'SK텔레콤',
        '시가':'120,200',
        '종가':'130,100'
    },
     {
        '날짜':'2021-12-31',
        '종목':'SK하이닉스',
        '시가':'50,230',
        '종가':'60,700'
    }
]
data = pd.DataFrame(stock_dict, columns=['날짜','종목','시가','종가'])
print(data)